class script(object):
    START_TXT = """<b>ʜᴇʟʟᴏ {} 🫡

ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴏɴʟʏ ʟᴀᴛᴇsᴛ ᴍᴏᴠɪᴇs😍

ᴛᴏ ᴋɴᴏᴡ ᴍᴏʀᴇ ᴀʙᴏᴜᴛ ᴍᴇ ᴜsᴇ ᴛʜᴇ ʙᴇʟᴏᴡ ᴏᴘᴛɪᴏɴs 👇</b>"""

    HELP_TXT = """"""
 
    ABOUT_TXT = """<b>
‣ ᴍʏ ɴᴀᴍᴇ : <a href="https://t.me/TIC_Latest_Movies_Bot">ʙᴏᴛ</a>
‣ ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href="https://t.me/DANGER1753">ᴅ ᴀ ɴ ɢ ᴇ ʀ</a>
‣ ʟɪʙʀᴀʀʏ : <a href="https://pyrogram.org/">ᴘʏʀᴏɢʀᴀᴍ</a>
‣ ʟᴀɴɢᴜᴀɢᴇ : <a href="https://www.python.org/">ᴘʏᴛʜᴏɴ</a>
‣ ᴅᴀᴛᴀʙᴀꜱᴇ : <a href="https://www.mongodb.com/">ᴍᴏɴɢᴏ ᴅʙ</a>
‣ ʜᴏꜱᴛᴇᴅ ᴏɴ : <a href="https://www.digitalocean.com/">ᴠᴘs</a>
‣ ʙᴜɪʟᴅ ꜱᴛᴀᴛᴜꜱ : ᴠ.𝟹.𝟶 [ꜱᴛᴀʙʟᴇ]
</b>"""
    
    USERS_TXT = """<b>
▪️ <u>ᴍᴇᴛʜᴏᴅ 𝟷</u>:
ɢᴇᴛ ғɪʟᴇs ᴅɪʀᴇᴄᴛʟʏ ғʀᴏᴍ ʙᴏᴛ ʙʏ sᴇɴᴅɪɴɢ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ ғʀᴏᴍ ɢᴏᴏɢʟᴇ

▪️ <u>ᴍᴇᴛʜᴏᴅ 𝟸</u>:
ɪ.ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɢʀᴏᴜᴘ  
ɪɪ.ᴀᴅᴅ ᴍᴇ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ & ᴍᴀᴋᴇ ᴍᴇ ᴀᴅᴍɪɴ [ᴀʟʟᴏᴡ ᴀʟʟ ʀɪɢʜᴛs ᴇxᴄᴇᴘᴛ ʀᴇᴍᴀɪɴ ᴀɴᴏɴʏᴍᴏᴜs]
ɪɪɪ.ᴛʜᴇɴ sᴇɴᴅ ᴀɴʏ ᴄᴏʀʀᴇᴄᴛ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ ғʀᴏᴍ ɢᴏᴏɢʟᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ ᴛᴏ ɢᴇᴛ ғɪʟᴇs
ɪᴠ.ʏᴏᴜ ᴄᴀɴ ᴀʟsᴏ ᴀᴅᴅ ʏᴏᴜʀ ғʀɪᴇɴᴅs ᴀɴᴅ ғᴀᴍɪʟʏ ᴛᴏ ᴛʜᴇ ɢʀᴏᴜᴘ 

▪️ <u>ᴇxᴀᴍᴘʟᴇ</u>:
✅ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ
✅ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ 𝟸𝟶𝟸𝟸
❌ ᴠɪᴋʀᴀɴᴛ ʀᴏɴᴀ ᴍᴏᴠɪᴇ

▪️ ᴡᴀᴛᴄʜ ғᴜʟʟ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ ᴛᴏ ᴜɴᴅᴇʀsᴛᴀɴᴅ ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴛʜᴇ ʙᴏᴛ 👇</b>"""

    SELECT = """
⚠ ᴛɪᴘ ⚠

sᴇʟᴇᴄᴛ "ǫᴜᴀʟɪᴛʏ" ʙᴜᴛᴛᴏɴ ᴛᴏ sᴇʟᴇᴄᴛ ᴛʜᴇ ʀᴇǫᴜɪʀᴇᴅ ǫᴜᴀʟɪᴛʏ ғɪʟᴇs

sᴇʟᴇᴄᴛ "ʟᴀɴɢᴜᴀɢᴇ" ʙᴜᴛᴛᴏɴ ᴛᴏ sᴇʟᴇᴄᴛ ᴛʜᴇ ʀᴇǫᴜɪʀᴇᴅ ʟᴀɴɢᴜᴀɢᴇ ғɪʟᴇs"""
    
    DISCLAIMER_TXT = """<b>
ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜɪꜱ ʙᴏᴛ ᴀʀᴇ ꜰʀᴇᴇʟʏ ᴀᴠᴀɪʟᴀʙʟᴇ ᴏɴ ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ ᴏʀ ᴘᴏꜱᴛᴇᴅ ʙʏ ꜱᴏᴍᴇʙᴏᴅʏ ᴇʟꜱᴇ. 

ᴊᴜꜱᴛ ꜰᴏʀ ᴇᴀꜱʏ ꜱᴇᴀʀᴄʜɪɴɢ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ɪɴᴅᴇxɪɴɢ ꜰɪʟᴇꜱ ᴡʜɪᴄʜ ᴀʀᴇ ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ᴏɴ ᴛᴇʟᴇɢʀᴀᴍ. 

ᴡᴇ ʀᴇꜱᴘᴇᴄᴛ ᴀʟʟ ᴛʜᴇ ᴄᴏᴘʏʀɪɢʜᴛ ʟᴀᴡꜱ ᴀɴᴅ ᴡᴏʀᴋꜱ ɪɴ ᴄᴏᴍᴘʟɪᴀɴᴄᴇ ᴡɪᴛʜ ᴅᴍᴄᴀ ᴀɴᴅ ᴇᴜᴄᴅ. 

ɪꜰ ᴀɴʏᴛʜɪɴɢ ɪꜱ ᴀɢᴀɪɴꜱᴛ ʟᴀᴡ ᴘʟᴇᴀꜱᴇ ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ ꜱᴏ ᴛʜᴀᴛ ɪᴛ ᴄᴀɴ ʙᴇ ʀᴇᴍᴏᴠᴇᴅ ᴀꜱᴀᴘ. 

ɪꜰ ʏᴏᴜ ʙᴇʟɪᴇᴠᴇ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ᴠɪᴏʟᴀᴛɪɴɢ ʏᴏᴜʀ ɪɴᴛᴇʟʟᴇᴄᴛᴜᴀʟ ᴘʀᴏᴘᴇʀᴛʏ, ᴄᴏɴᴛᴀᴄᴛ ᴛʜᴇ ʀᴇꜱᴘᴇᴄᴛɪᴠᴇ ᴄʜᴀɴɴᴇʟꜱ ꜰᴏʀ ʀᴇᴍᴏᴠᴀʟ. 
</b>"""

    EXTRAMOD_TXT = """<b>
ɴᴏᴛᴇ:
ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ᴇxᴛʀᴀ ꜰᴇᴀᴛᴜʀᴇꜱ ᴏꜰ ᴛʜɪꜱ ʙᴏᴛ

Cᴏᴍᴍᴀɴᴅs Aɴᴅ Usᴀɢᴇ:
• /id - ɢᴇᴛ ɪᴅ ᴏꜰ ᴀ ꜱᴘᴇᴄɪꜰɪᴇᴅ ᴜꜱᴇʀ.
• /info  - ɢᴇᴛ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜꜱᴇʀ.
• /imdb  - ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ɪᴍᴅʙ ꜱᴏᴜʀᴄᴇ.
• /search  - ɢᴇᴛ ᴛʜᴇ ꜰɪʟᴍ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ ꜰʀᴏᴍ ᴠᴀʀɪᴏᴜꜱ ꜱᴏᴜʀᴄᴇꜱ.</b>"""

    SOURCE_TXT = """
<b>ᴛʜɪs ʀᴇᴘᴏ ɪs ɴᴏᴛ ᴏᴘᴇɴ sᴏᴜʀᴄᴇ.

ᴄᴏɴᴛᴀᴄᴛ ᴅᴇᴠᴇʟᴏᴘᴇʀ ғᴏʀ ᴛʜᴇ ʀᴇᴘᴏ 😊</b>"""
    
    STATUS_TXT = """<b>
★ ᴛᴏᴛᴀʟ ғɪʟᴇs : <code>{}</code>
★ ᴛᴏᴛᴀʟ ᴜsᴇʀs : <code>{}</code>
★ ᴛᴏᴛᴀʟ ᴄʜᴀᴛs : <code>{}</code>
★ ᴜsᴇᴅ sᴛᴏʀᴀɢᴇ : <code>{} MB</code>
★ ғʀᴇᴇ sᴛᴏʀᴀɢᴇ : <code>{} MB</code>
</b>"""

    LOG_TEXT_G = """#NewGroup 3️⃣
Gʀᴏᴜᴘ = {}(<code>{}</code>)
Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs = <code>{}</code>
Aᴅᴅᴇᴅ Bʏ - {}"""

    LOG_TEXT_P = """#NewUser 3️⃣
ID - <code>{}</code>
Nᴀᴍᴇ - {}"""

    NORSLTS = """#NoResults 3️⃣
ID : <code>{}</code>
Nᴀᴍᴇ : {}
ᴍᴇssᴀɢᴇ : {}"""

    ALRT_TXT = """ʜᴇʟʟᴏ {},
ᴛʜɪs ɪs ɴᴏᴛ ʏᴏᴜʀ ʀᴇǫᴜᴇsᴛ ,
ʀᴇǫᴜᴇsᴛ ʏᴏᴜʀ ᴏᴡɴ..."""

    OLD_ALRT_TXT = """ʜᴇʏ {},
ʏᴏᴜ ᴀʀᴇ ᴜsɪɴɢ ᴏɴᴇ ᴏғ ᴍʏ ᴏʟᴅ ᴍᴇssᴀɢᴇs, 
ᴘʟᴇᴀsᴇ sᴇɴᴅ ᴛʜᴇ ʀᴇǫᴜᴇsᴛ ᴀɢᴀɪɴ."""

    CUDNT_FND = """ɪ ᴄᴏᴜʟᴅɴ'ᴛ ғɪɴᴅ ᴀɴʏᴛʜɪɴɢ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}
ᴅɪᴅ ʏᴏᴜ ᴍᴇᴀɴ ᴀɴʏ ᴏɴᴇ ᴏғ ᴛʜᴇsᴇ ?"""

    I_CUDNT = """ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏ ғɪʟᴇ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}.
ᴘʟᴇᴀꜱᴇ ᴄʜᴇᴄᴋ ᴛʜᴇ ꜱᴘᴇʟʟɪɴɢ ɪɴ ɢᴏᴏɢʟᴇ ᴏʀ ɪᴍᴅʙ..."""

    I_CUD_NT = """ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏ ғɪʟᴇ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}.
ᴘʟᴇᴀꜱᴇ ᴄʜᴇᴄᴋ ᴛʜᴇ ꜱᴘᴇʟʟɪɴɢ ɪɴ ɢᴏᴏɢʟᴇ ᴏʀ ɪᴍᴅʙ..."""

    MVE_NT_FND = """<b>sᴏʀʀʏ ɴᴏ ғɪʟᴇs ᴡᴇʀᴇ ғᴏᴜɴᴅ ғᴏʀ ʏᴏᴜʀ ʀᴇǫᴜᴇsᴛ 😕

ɪғ ᴛʜᴇ ғɪʟᴇs ᴀʀᴇ ɴᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ᴇᴠᴇɴ ᴀғᴛᴇʀ ᴜsɪɴɢ ᴄᴏʀʀᴇᴄᴛ ɴᴀᴍᴇ
ᴀʟsᴏ ɪᴛ sʜᴏᴜʟᴅ ʜᴀᴠᴇ ʙᴇᴇɴ ʀᴇʟᴇᴀsᴇᴅ ɪɴ ᴏᴛᴛ
ᴛʜᴇɴ ʀᴇǫᴜᴇsᴛ ᴜs @TheInsomniacsClub ᴡᴇ ᴡɪʟʟ ᴜᴘʟᴏᴀᴅ ᴀsᴀᴘ

ʀᴇǫᴜᴇsᴛ ғᴏʀᴍᴀᴛ :
ɴᴀᴍᴇ ᴏғ ᴛʜᴇ ᴍᴏᴠɪᴇ
ʏᴇᴀʀ
ʟᴀɴɢᴜᴀɢᴇ</b>"""

    TOP_ALRT_MSG = """ᴄʜᴇᴄᴋɪɴɢ ғᴏʀ ғɪʟᴇs ɪɴ ᴅᴀᴛᴀʙᴀsᴇ..."""

    MELCOW_ENG = """<b>ʜᴇʟʟᴏ {} 👋, 
ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ {} ɢʀᴏᴜᴘ ❤️</b>"""

    CAPTION = """<b>{file_name} 

ᴊᴏɪɴ ➠ @TheInsomniacsClub</b>"""
    
    IMDB_TEMPLATE_TXT = """
<b>📚 ʀᴇsᴜʟᴛs ғᴏʀ ☞ {search}

ɪᴍᴅʙ ᴅᴀᴛᴀ:
🏷 ᴛɪᴛʟᴇ : <a href={url}>{title}</a>
🌟 ʀᴀᴛɪɴɢ : <a href={url}/ratings>{rating}</a> / 10 [Based on {votes} Votes]
🎭 ɢᴇɴʀᴇs : {genres}
📆 ʀᴇʟᴇᴀsᴇ ʏᴇᴀʀ : <a href={url}/releaseinfo>{year}</a></b>"""

    RESTART_TXT = """<b>1️⃣ ᴛɪᴄ ᴍᴏᴠɪᴇs ʙᴏᴛ ʜᴀs ʙᴇᴇɴ ʀᴇsᴛᴀʀᴛᴇᴅ 1️⃣</b>"""

    LOGO = """
    ▀█▀ █░█ █▀▀ █ █▄░█ █▀ █▀█ █▀▄▀█ █▄░█ █ ▄▀█ █▀▀ █▀ █▀▀ █░░ █░█ █▄▄
    ░█░ █▀█ ██▄ █ █░▀█ ▄█ █▄█ █░▀░█ █░▀█ █ █▀█ █▄▄ ▄█ █▄▄ █▄▄ █▄█ █▄█
    """

